#  OSとカーネル
- カーネルの役割
- OSとカーネルの関係
# Linux
- Linuxとは何？だれが作った？
- 何の影響を受けている？
- 狭義の意味で、作者が作ったのはどこまで＿コマンドは？
## ソースは？
- Linuxのカーネルソースはどこ？
- LCD6,EVAH7800 に使用されているi.mx6ull用のソースは？
  何が違う？
# UNIXとLinux
- UnixとLinuxのコマンドの関係は?
- Unix,Linuxを作るときに使用されている言語は？
- 動作可能なマシンは？
- プロプライエタリ？
- unixコマンドの特徴は？ラーメン？？との共通点？
# ディストリビューション
- ディストリビューションとは何？
- どんなものがある？XX系？
  PC,server用、組み込み用
# 起動の仕組み
- Linuxはどうやって起動される？
- kernelのファイル

# ファイルシステム
- ファイルシステムとは何？
- どんなもんがある？
- MS-Windowsとの違いは？
## root file system
- ユーザランドとは?
## ファイルの種類
- fileタイプには何がある？
- パーミッションについて
  分類は？

# シェルとコマンド実行
- シェルとは何？
   どんなものがある？
## キー操作 bash EMACS風
  - 1文字移動　左、右
  - 単語単位移動　左単語、右単語
  - 削除  カーソルより前、カーソルより後ろ、１文字、単語削除
## ファイル情報を調べるコマンド
 - コマンドのオプション
 - 見方
 - 詳細なファイル情報を調べるには？
    実行ファイル、画像、動画、プログラム言語のソースなどまで見れるコマンドは？
 - テキストファイルの行数、文字数、単語数など調べるには？
 - ファイルの内容表示
## ファイルのパーミッション変更
 - 実行、書き込み、読み込み
 - 実行時のユーザを設定
 - 所有者以外のユーザによるファイル削除防止
## ファイル操作コマンド
- 作成　ファイル、ディレクトリ
- 削除　ファイル、ディレクトリ、再帰
- 移動
- 所有者変更
- リンク
- 日付変更
- 現在のディレクトリとは？変更するには？
  - ホームディレクトリにするには
## path
- 何？どんなもの？
- 現在のdir
## コマンドライン引数
- 引数とは？
- argc,argvは何?
## コマンドのオプション
 - 使い方を調べるオプション
 - short , long optsについて
## 便利なもの
- 履歴
  - どうやって調べる？
  - 過去に実行したコマンドを実行するには
    直前、xxxで始まるコマンド、調べて実行
  - 履歴検索のキー操作は？
  - 直前のコマンドラインの右端、先頭、n番目、全部を示すには？  
- 別名
  - コマンド名
  - 何ができる？






